hansonfang/esp8266-ai/firmware/src/main.cpp
StockRow stocks[MAX_STOCKS];
int stockCount = 0;
bool stockEverLoaded = false;
bool stockDirty = false;
bool stockChromeDrawn = false;
String stockLastCode[MAX_STOCKS]; // top line (code + CJK name strip)
String stockLastVal[MAX_STOCKS];  // value line (price + pct)
unsigned long lastStockPollMs = 0;
// CJK names come as Mac-rendered RGB565 strips (GET /stock/names.raw, one
// 156x16 strip per row) - names_rev says when to re-fetch. -1 = not drawn.
const int STOCK_NAME_W = 156, STOCK_NAME_H = 16;
int stockNamesRev = -1;
int stockNamesDrawnRev = -1;

String musicTitle, musicArtist, musicAlbum;
bool musicPlaying = false;
int musicElapsed = 0, musicDuration = 0;
int musicArtworkRev = -1;
int musicTextRev = -1;
bool musicHasArtwork = false;
bool musicChromeDrawn = false;
unsigned long lastMusicPollMs = 0;

int claudeFrame = 0;
int codexFrame = 0;
unsigned long lastAnimMs = 0;

bool flashOn = true;
unsigned long lastFlashMs = 0;

// Bridge host is not asked for during first-time WiFi setup: the Mac/Windows
// bridge discovers the device and pairs automatically (or set via /api/bridge).
String bridgeHost;

struct ClaudeStatus {
  String status = "unknown";
  long tokensToday = 0;
  int sessionMin = 0;
  int sessionWindowMin = 300;
  float fiveHourPct = -1; // real OAuth quota from the bridge, -1 = unknown
  int fiveHourResetMin = -1; // minutes until the 5h window resets
  float sevenDayPct = -1;
  int sevenDayResetMin = -1; // minutes until the 7-day window resets
  bool needsInput = false; // waiting on a permission/approval prompt
};

struct CodexStatus {
  String status = "unknown";
  long tokensToday = 0;
  float primaryPct = -1;
  int primaryResetMin = -1;
  float weeklyPct = -1;
  int weeklyResetMin = -1;
  bool needsInput = false;
  String petState = "";
};

ClaudeStatus claudeStatus;
CodexStatus codexStatus;

// OpenPet-compatible event overlay. Existing Codex artwork remains the pet;
// the event changes its label, border color and (for tool-running) animation.
enum AgentEvent { EVENT_NONE, EVENT_THINKING, EVENT_TOOL_RUNNING, EVENT_REVIEWING, EVENT_SUCCESS, EVENT_FAILURE, EVENT_ATTENTION };
AgentEvent agentEvent = EVENT_NONE;
unsigned long agentEventDeadlineMs = 0;

unsigned long lastPollMs = 0;
unsigned long lastSuccessMs = 0;
bool everPolled = false;
bool mainUiShown = false;      // false while the config-portal screen is up
bool webServerStarted = false; // deferred: port 80 clashes with the portal

// ---------- backlight brightness ----------
// The panel backlight (TFT_BL, active LOW) is PWM-dimmable — the vendor's own
// firmware does the same. 0 = off, 100 = full. Persisted so it survives reboot.

int brightness = BRIGHTNESS_DEFAULT; // 0-100
bool screenOn = true; // USB bridge mirrors the Mac's physical display sleep state.

void applyBrightness() {
  // analogWriteRange(100) is set in setup(), so the duty value is just the
  // inverted percentage (active LOW: 0 duty = always LOW = full on).
  analogWrite(TFT_BL, screenOn ? 100 - brightness : 100);
}

void loadBrightness() {
  if (!LittleFS.exists(BRIGHTNESS_FILE)) return;
  File f = LittleFS.open(BRIGHTNESS_FILE, "r");
  if (!f) return;
  int v = f.readStringUntil('\n').toInt();
  f.close();
  if (v >= 0 && v <= 100) brightness = v;
}

void saveBrightness() {
  File f = LittleFS.open(BRIGHTNESS_FILE, "w");
  if (!f) return;
  f.println(brightness);
  f.close();
}

// ---------- display mode persistence ----------

void loadDisplayMode() {
  if (!LittleFS.exists(DISPLAY_MODE_FILE)) return;
  File f = LittleFS.open(DISPLAY_MODE_FILE, "r");
  if (!f) return;
  String savedMode = f.readStringUntil('\n');
  savedMode.trim();
  f.close();

  DisplayMode mode;
  if (parseDisplayMode(savedMode, mode)) displayMode = mode;
}

void saveDisplayMode() {
  File f = LittleFS.open(DISPLAY_MODE_FILE, "w");
  if (!f) return;
  f.println(displayModeName(displayMode));
  f.close();
}

// ---------- persistence for the bridge host ----------

void loadBridgeHost() {
  if (LittleFS.exists(WIFI_CONFIG_FILE)) {
    File f = LittleFS.open(WIFI_CONFIG_FILE, "r");
    bridgeHost = f.readStringUntil('\n');
    bridgeHost.trim();
    f.close();
  }
}

void saveBridgeHost(const String &host) {
  File f = LittleFS.open(WIFI_CONFIG_FILE, "w");
  f.println(host);
  f.close();
}

// ---------- custom sprite loading ----------

inline uint16_t swap565(uint16_t c) { return (uint16_t)((c << 8) | (c >> 8)); }

uint16_t rgb332ToWire(uint8_t c) {
  uint8_t r = ((c >> 5) * 255) / 7;
  uint8_t g = (((c >> 2) & 7) * 255) / 7;
  uint8_t b = ((c & 3) * 255) / 3;
  return swap565((uint16_t)(((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3)));
}

uint8_t wire565ToRGB332(uint16_t wire) {
  uint16_t c = swap565(wire);
  uint8_t r = (c >> 8) & 0xF8;
  uint8_t g = (c >> 3) & 0xFC;
  uint8_t b = (c << 3) & 0xF8;
  return (r & 0xE0) | ((g & 0xE0) >> 3) | (b >> 6);
}

// One-time conversion of pre-0.4.12 custom RGB565 files. The new RGB332
// representation halves flash use so a full 57-frame Codex pet still fits.
bool migrateLegacySprite(const char *path, int w, int h) {
  if (!LittleFS.exists(path)) return true;
  File in = LittleFS.open(path, "r");
  if (!in || in.size() < 1) { if (in) in.close(); return false; }
  char magic[3];
  if (in.readBytes(magic, 3) == 3 && !memcmp(magic, "SP8", 3)) { in.close(); return true; }
  in.seek(0);
  uint8_t count = in.read();
  size_t oldFrameBytes = (size_t)w * h * 2;
  if (count == 0 || count > MAX_CUSTOM_FRAMES || (size_t)in.size() != 1 + (size_t)count * oldFrameBytes) {
    in.close();
    return false;
  }
  const char *temp = "/sprite.tmp";
  File out = LittleFS.open(temp, "w");
  if (!out) { in.close(); return false; }
  out.write((const uint8_t *)"SP8", 3);
  out.write(count);
  for (int frame = 0; frame < count; frame++) {
    for (int y = 0; y < h; y++) {
      if (in.read((uint8_t *)rowBuf, (size_t)w * 2) != w * 2) {
        in.close(); out.close(); LittleFS.remove(temp); return false;
      }
      for (int x = 0; x < w; x++) sprite8Row[x] = wire565ToRGB332(rowBuf[x]);
      out.write(sprite8Row, w);
    }
    yield();
  }
  in.close();
  out.close();
  LittleFS.remove(path);
  return LittleFS.rename(temp, path);
}

uint16_t readLE16(const uint8_t *p) { return (uint16_t)p[0] | ((uint16_t)p[1] << 8); }
uint32_t readLE32(const uint8_t *p) {
  return (uint32_t)p[0] | ((uint32_t)p[1] << 8) | ((uint32_t)p[2] << 16) | ((uint32_t)p[3] << 24);
}

uint32_t crc32Update(uint32_t crc, const uint8_t *data, size_t length) {
  for (size_t i = 0; i < length; i++) {
    crc ^= data[i];
    for (int bit = 0; bit < 8; bit++) crc = (crc >> 1) ^ ((crc & 1) ? 0xEDB88320UL : 0);
  }
  return crc;
}

bool loadCodexPetFile(const char *path) {
  codexPetCustom = false;
  File f = LittleFS.open(path, "r");
  if (!f || f.size() < AIPET_HEADER_BYTES) { if (f) f.close(); return false; }
  uint8_t header[AIPET_HEADER_BYTES];
  if (f.read(header, sizeof(header)) != sizeof(header) || memcmp(header, "AIPET1", 6) ||
      readLE16(header + 6) != CODEX_SPRITE_W || readLE16(header + 8) != CODEX_SPRITE_H ||
      header[10] != PET_STATE_COUNT || readLE32(header + 12) != (uint32_t)f.size()) {
    f.close(); return false;
  }
  uint32_t expectedCRC = readLE32(header + 16);
  uint32_t expectedOffset = AIPET_HEADER_BYTES;
  for (int i = 0; i < PET_STATE_COUNT; i++) {
    const uint8_t *entry = header + 20 + i * 12;
    PetStateMeta meta = { entry[0], readLE16(entry + 2), readLE32(entry + 4), readLE32(entry + 8) };
    if (meta.frames == 0 || meta.frames > 8 || meta.delayMs < 40 || meta.offset != expectedOffset ||
        meta.length != (uint32_t)meta.frames * CODEX_FRAME_BYTES_332) { f.close(); return false; }
    codexPetStates[i] = meta;
    expectedOffset += meta.length;
  }
  if (expectedOffset != (uint32_t)f.size()) { f.close(); return false; }
  uint32_t crc = 0xFFFFFFFFUL;
  while (f.available()) {
    int n = f.read(sprite8Row, sizeof(sprite8Row));
    if (n <= 0) break;
    crc = crc32Update(crc, sprite8Row, n);
    yield();
  }
  f.close();
  if ((crc ^ 0xFFFFFFFFUL) != expectedCRC) return false;
  codexPetCustom = true;
  return true;
}

// Checks LittleFS for a previously-uploaded custom sprite and validates its
// size before trusting it (frame count byte + exact expected byte length).
void loadCustomSpriteState() {
  migrateLegacySprite(CLAUDE_SPRITE_FILE, CLAUDE_SPRITE_W, CLAUDE_SPRITE_H);
  migrateLegacySprite(CODEX_SPRITE_FILE, CODEX_SPRITE_W, CODEX_SPRITE_H);
  claudeCustom = false;
  if (LittleFS.exists(CLAUDE_SPRITE_FILE)) {
    File f = LittleFS.open(CLAUDE_SPRITE_FILE, "r");
    if (f && f.size() >= 4) {
      char magic[3]; f.readBytes(magic, 3); uint8_t cnt = f.read();
      size_t expected = 4 + (size_t)cnt * CLAUDE_FRAME_BYTES_332;
      if (!memcmp(magic, "SP8", 3) && cnt > 0 && cnt <= MAX_CUSTOM_FRAMES && (size_t)f.size() == expected) {
        claudeCustom = true;
        claudeCustomFrames = cnt;
      }
    }
    if (f) f.close();
  }

